gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_SETLIB.c

#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/DL698_SETLIB.h"
#include "../DL698/DL698_SETLIB_EVENT.h"
#include "../Device/MEMRW.h"
#include "../MS/MS.h"
#include "../Display/Display.h"
#include "../STM32F4xx/STM32F4xx_CRC.h"
#include "../STM32F4xx/STM32F4xx_WDG.h"





//----集中器----
#if ((Project/100)==2)//集中器
#if USER<200//盲样电科院送检系,标准系
#include "../DL698/DL698_SETInit_USER0xx.c"
#include "../DL698/DL698_SETInit_6000_Project2xx_USER0xx.c"
#endif

#if (USER/100)==9//河南系
#include "../DL698/DL698_SETInit_USER9xx.c"
#include "../DL698/DL698_SETInit_6000_Project2xx_USER9xx.c"
#endif

#if (USER/100)==14//福建
#include "../DL698/DL698_SETInit_USER14xx.c"
#include "../DL698/DL698_SETInit_6000_Project2xx_USER14xx.c"
#endif

#if (USER/100)==15//安徽系
#include "../DL698/DL698_SETInit_USER15xx.c"
#include "../DL698/DL698_SETInit_6000_Project2xx_USER15xx.c"
#endif

#if (USER/100)==17//江苏系
#include "../DL698/DL698_SETInit_USER17xx.c"
#include "../DL698/DL698_SETInit_6000_Project2xx_USER17xx.c"
#endif

#endif//#if ((Project/100)==2)//集中器
//----集中器 end----


//-----专变----
#if ((Project/100)==3)//专变
#if USER<200//盲样电科院送检系,标准系
#include "../DL698/DL698_SETInit_USER0xx.c"
#include "../DL698/DL698_SETInit_6000_Project3xx_USER0xx.c"
#endif

#if (USER/100)==9//河南系
#include "../DL698/DL698_SETInit_USER9xx.c"
#include "../DL698/DL698_SETInit_6000_Project3xx_USER9xx.c"
#endif
#if (USER/100)==12//四川系
#include "../DL698/DL698_SETInit_USER12xx.c"
#include "../DL698/DL698_SETInit_6000_Project3xx_USER12xx.c"
#endif
#if (USER/100)==14//福建
#include "../DL698/DL698_SETInit_USER14xx.c"
#include "../DL698/DL698_SETInit_6000_Project3xx_USER14xx.c"
#endif

#if (USER/100)==15//安徽系
#include "../DL698/DL698_SETInit_USER15xx.c"
#include "../DL698/DL698_SETInit_6000_Project3xx_USER15xx.c"
#endif


#endif//#if ((Project/100)==3)//专变
//-----专变 end----


//----三合一终端----
#if ((Project/100)==4)//三合一终端
#if (USER/100)==16//内蒙系
#include "../DL698/DL698_SETInit_USER16xx.c"
#include "../DL698/DL698_SETInit_6000_Project4xx_USER16xx.c"
#endif


#endif//#if ((Project/100)==4)//三合一终端
//----三合一终端 end----




#include "../DL698/DL698_SETLIB_2000.c"
#include "../DL698/DL698_SETLIB_4000.c"
#include "../DL698/DL698_SETLIB_5000.c"
#include "../DL698/DL698_SETLIB_6000.c"
#include "../DL698/DL698_SETLIB_8000.c"
#include "../DL698/DL698_SETLIB_F000.c"


__align(4) const DL698_LIB_List_TypeDef  DL698_SETLIB_List[]=
{
//---通信类---
	{(u32*)DL698_SETLIB_4001,},
	{(u32*)DL698_SETLIB_4005,},
	{(u32*)DL698_SETLIB_4002,},
	{(u32*)DL698_SETLIB_4003,},
	{(u32*)DL698_SETLIB_4400_4,},
	{(u32*)DL698_SETLIB_4401,},
	{(u32*)DL698_SETLIB_4500_2,},
	{(u32*)DL698_SETLIB_4500_3,},
	{(u32*)DL698_SETLIB_4500_4,},
	{(u32*)DL698_SETLIB_4500_5,},
	{(u32*)DL698_SETLIB_4500_6,},
	{(u32*)DL698_SETLIB_4500_7,},
	{(u32*)DL698_SETLIB_4500_8,},
	{(u32*)DL698_SETLIB_4500_9,},
	{(u32*)DL698_SETLIB_4500_10,},
	{(u32*)DL698_SETLIB_4500_11,},
	{(u32*)DL698_SETLIB_4510_2,},
	{(u32*)DL698_SETLIB_4510_3,},
	{(u32*)DL698_SETLIB_4510_4,},
	{(u32*)DL698_SETLIB_4510_5,},
	{(u32*)DL698_SETLIB_4520_2,},//因放在扩展区故定义为非通信参数,否则非工厂时参数区会先清0但不初始化!


//---通用类---
	{(u32*)DL698_SETLIB_4000,},
	{(u32*)DL698_SETLIB_4000_3,},
	{(u32*)DL698_SETLIB_4000_4,},
	{(u32*)DL698_SETLIB_4004,},
	{(u32*)DL698_SETLIB_4006,},
	{(u32*)DL698_SETLIB_4007,},
	{(u32*)DL698_SETLIB_4008,},
	{(u32*)DL698_SETLIB_4009,},
	{(u32*)DL698_SETLIB_400A,},
	{(u32*)DL698_SETLIB_400B,},
	{(u32*)DL698_SETLIB_400C,},
	{(u32*)DL698_SETLIB_400D,},
	{(u32*)DL698_SETLIB_400E,},
	{(u32*)DL698_SETLIB_400F,},
	{(u32*)DL698_SETLIB_4010,},
	{(u32*)DL698_SETLIB_4011,},
	{(u32*)DL698_SETLIB_4012,},
	{(u32*)DL698_SETLIB_4013,},
	{(u32*)DL698_SETLIB_4014,},
	{(u32*)DL698_SETLIB_4015,},
	{(u32*)DL698_SETLIB_4016,},
	{(u32*)DL698_SETLIB_4017,},
	{(u32*)DL698_SETLIB_4018,},
	{(u32*)DL698_SETLIB_4019,},
	{(u32*)DL698_SETLIB_401A,},
	{(u32*)DL698_SETLIB_401B,},
	{(u32*)DL698_SETLIB_401C,},
	{(u32*)DL698_SETLIB_401D,},
	{(u32*)DL698_SETLIB_401E,},
	{(u32*)DL698_SETLIB_401F,},
	{(u32*)DL698_SETLIB_4020,},
	{(u32*)DL698_SETLIB_4021,},
	{(u32*)DL698_SETLIB_4022,},
	{(u32*)DL698_SETLIB_4023,},
	{(u32*)DL698_SETLIB_4024,},
	{(u32*)DL698_SETLIB_4030,},
	{(u32*)DL698_SETLIB_4100,},
	{(u32*)DL698_SETLIB_4101,},
	{(u32*)DL698_SETLIB_4102,},
	{(u32*)DL698_SETLIB_4103,},
	{(u32*)DL698_SETLIB_4104,},
	{(u32*)DL698_SETLIB_4105,},
	{(u32*)DL698_SETLIB_4106,},
	{(u32*)DL698_SETLIB_4107,},
	{(u32*)DL698_SETLIB_4108,},
	{(u32*)DL698_SETLIB_4109,},
	{(u32*)DL698_SETLIB_410A,},
	{(u32*)DL698_SETLIB_410B,},
	{(u32*)DL698_SETLIB_410C,},
	{(u32*)DL698_SETLIB_410D,},
	{(u32*)DL698_SETLIB_410E,},
	{(u32*)DL698_SETLIB_410F,},
	{(u32*)DL698_SETLIB_4111,},
	{(u32*)DL698_SETLIB_4112,},
	{(u32*)DL698_SETLIB_4113,},
	{(u32*)DL698_SETLIB_4114,},
	{(u32*)DL698_SETLIB_4115,},
	{(u32*)DL698_SETLIB_4116,},
	{(u32*)DL698_SETLIB_4117,},

	
//---终端类---
//4200	11	路由表
//4201	8	路由信息单元
	{(u32*)DL698_SETLIB_4202,},
	{(u32*)DL698_SETLIB_4204_2,},
	{(u32*)DL698_SETLIB_4204_3,},
	
//版本信息
	{(u32*)DL698_SETLIB_4300_2,},
	{(u32*)DL698_SETLIB_4300_3,},
	{(u32*)DL698_SETLIB_4300_4,},
	{(u32*)DL698_SETLIB_4300_5,},
	{(u32*)DL698_SETLIB_4300_6,},
	{(u32*)DL698_SETLIB_4300_7,},
	{(u32*)DL698_SETLIB_4300_8,},
	{(u32*)DL698_SETLIB_4300_9,},
	{(u32*)DL698_SETLIB_4300_10,},
	
//冻结类
	{(u32*)DL698_SETLIB_5000,},
	{(u32*)DL698_SETLIB_5001,},
	{(u32*)DL698_SETLIB_5002,},
	{(u32*)DL698_SETLIB_5003,},
	{(u32*)DL698_SETLIB_5004,},
	{(u32*)DL698_SETLIB_5005,},
	{(u32*)DL698_SETLIB_5006,},
	{(u32*)DL698_SETLIB_5007,},
	{(u32*)DL698_SETLIB_5008,},
	{(u32*)DL698_SETLIB_5009,},
	{(u32*)DL698_SETLIB_500A,},
	{(u32*)DL698_SETLIB_500B,},
	{(u32*)DL698_SETLIB_5011,},
	
//采集监控
	{(u32*)DL698_SETLIB_6000_2_0,},//定位第0个采集档案地址，不能删除
	{(u32*)DL698_SETLIB_6000_2_1,},
	{(u32*)DL698_SETLIB_6000_2_2,},
	{(u32*)DL698_SETLIB_6000_2_3,},
	{(u32*)DL698_SETLIB_6000_2_4,},
	{(u32*)DL698_SETLIB_6000_2_5,},
	{(u32*)DL698_SETLIB_6000_2_6,},
	{(u32*)DL698_SETLIB_6000_2_7,},
	{(u32*)DL698_SETLIB_6000_2_8,},
	{(u32*)DL698_SETLIB_6000_2_9,},

