gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_SETLIB.c
	{(u32*)DL698_SETLIB_6000_3,},
	{(u32*)DL698_SETLIB_6000_4,},
	
	{(u32*)DL698_SETLIB_6002_2,},//仅使库中OAD有效
	{(u32*)DL698_SETLIB_6002_3,},//仅使库中OAD有效
	{(u32*)DL698_SETLIB_6002_4,},//仅使库中OAD有效
	{(u32*)DL698_SETLIB_6002_5,},//仅使库中OAD有效
	{(u32*)DL698_SETLIB_6002_6,},//所有搜表结果记录数(仅使库中OAD有效)
	{(u32*)DL698_SETLIB_6002_7,},//跨台区搜表结果记录数(仅使库中OAD有效)
	{(u32*)DL698_SETLIB_6002_8,},
	{(u32*)DL698_SETLIB_6002_9,},
	{(u32*)DL698_SETLIB_6002_10,},


	{(u32*)DL698_SETLIB_6012_2_0,},//定位第0个地址，不能删除
#ifdef InitData_6012_2_1_
	{(u32*)DL698_SETLIB_6012_2_1,},
#endif
#ifdef InitData_6012_2_2_
	{(u32*)DL698_SETLIB_6012_2_2,},
#endif
#ifdef InitData_6012_2_3_
	{(u32*)DL698_SETLIB_6012_2_3,},
#endif
#ifdef InitData_6012_2_4_
	{(u32*)DL698_SETLIB_6012_2_4,},
#endif
#ifdef InitData_6012_2_5_
	{(u32*)DL698_SETLIB_6012_2_5,},
#endif
#ifdef InitData_6012_2_6_
	{(u32*)DL698_SETLIB_6012_2_6,},
#endif
#ifdef InitData_6012_2_7_
	{(u32*)DL698_SETLIB_6012_2_7,},
#endif
#ifdef InitData_6012_2_8_
	{(u32*)DL698_SETLIB_6012_2_8,},
#endif
#ifdef InitData_6012_2_9_
	{(u32*)DL698_SETLIB_6012_2_9,},
#endif
#ifdef InitData_6012_2_10_
	{(u32*)DL698_SETLIB_6012_2_10,},
#endif
#ifdef InitData_6012_2_11_
	{(u32*)DL698_SETLIB_6012_2_11,},
#endif
#ifdef InitData_6012_2_12_
	{(u32*)DL698_SETLIB_6012_2_12,},
#endif
#ifdef InitData_6012_2_13_
	{(u32*)DL698_SETLIB_6012_2_13,},
#endif
#ifdef InitData_6012_2_14_
	{(u32*)DL698_SETLIB_6012_2_14,},
#endif
#ifdef InitData_6012_2_15_
	{(u32*)DL698_SETLIB_6012_2_15,},
#endif
#ifdef InitData_6012_2_16_
	{(u32*)DL698_SETLIB_6012_2_16,},
#endif
#ifdef InitData_6012_2_17_
	{(u32*)DL698_SETLIB_6012_2_17,},
#endif
#ifdef InitData_6012_2_18_
	{(u32*)DL698_SETLIB_6012_2_18,},
#endif
#ifdef InitData_6012_2_19_
	{(u32*)DL698_SETLIB_6012_2_19,},
#endif
#ifdef InitData_6012_2_20_
	{(u32*)DL698_SETLIB_6012_2_20,},
#endif
#ifdef InitData_6012_2_21_
	{(u32*)DL698_SETLIB_6012_2_21,},
#endif
#ifdef InitData_6012_2_22_
	{(u32*)DL698_SETLIB_6012_2_22,},
#endif
#ifdef InitData_6012_2_23_
	{(u32*)DL698_SETLIB_6012_2_23,},
#endif
#ifdef InitData_6012_2_24_
	{(u32*)DL698_SETLIB_6012_2_24,},
#endif
#ifdef InitData_6012_2_25_
	{(u32*)DL698_SETLIB_6012_2_25,},
#endif
#ifdef InitData_6012_2_26_
	{(u32*)DL698_SETLIB_6012_2_26,},
#endif
#ifdef InitData_6012_2_27_
	{(u32*)DL698_SETLIB_6012_2_27,},
#endif
#ifdef InitData_6012_2_28_
	{(u32*)DL698_SETLIB_6012_2_28,},
#endif
#ifdef InitData_6012_2_29_
	{(u32*)DL698_SETLIB_6012_2_29,},
#endif
#ifdef InitData_6012_2_30_
	{(u32*)DL698_SETLIB_6012_2_30,},
#endif
#ifdef InitData_6012_2_31_
	{(u32*)DL698_SETLIB_6012_2_31,},
#endif
#ifdef InitData_6012_2_32_
	{(u32*)DL698_SETLIB_6012_2_32,},
#endif
#ifdef InitData_6012_2_33_
	{(u32*)DL698_SETLIB_6012_2_33,},
#endif
#ifdef InitData_6012_2_34_
	{(u32*)DL698_SETLIB_6012_2_34,},
#endif
#ifdef InitData_6012_2_35_
	{(u32*)DL698_SETLIB_6012_2_35,},
#endif
#ifdef InitData_6012_2_36_
	{(u32*)DL698_SETLIB_6012_2_36,},
#endif
#ifdef InitData_6012_2_37_
	{(u32*)DL698_SETLIB_6012_2_37,},
#endif
#ifdef InitData_6012_2_38_
	{(u32*)DL698_SETLIB_6012_2_38,},
#endif
#ifdef InitData_6012_2_39_
	{(u32*)DL698_SETLIB_6012_2_39,},
#endif
#ifdef InitData_6012_2_40_
	{(u32*)DL698_SETLIB_6012_2_40,},
#endif
#ifdef InitData_6012_2_41_
	{(u32*)DL698_SETLIB_6012_2_41,},
#endif
#ifdef InitData_6012_2_42_
	{(u32*)DL698_SETLIB_6012_2_42,},
#endif
#ifdef InitData_6012_2_43_
	{(u32*)DL698_SETLIB_6012_2_43,},
#endif
#ifdef InitData_6012_2_44_
	{(u32*)DL698_SETLIB_6012_2_44,},
#endif
#ifdef InitData_6012_2_45_
	{(u32*)DL698_SETLIB_6012_2_45,},
#endif
#ifdef InitData_6012_2_46_
	{(u32*)DL698_SETLIB_6012_2_46,},
#endif
#ifdef InitData_6012_2_47_
	{(u32*)DL698_SETLIB_6012_2_47,},
#endif
#ifdef InitData_6012_2_48_
	{(u32*)DL698_SETLIB_6012_2_48,},
#endif
#ifdef InitData_6012_2_49_
	{(u32*)DL698_SETLIB_6012_2_49,},
#endif
#ifdef InitData_6012_2_50_
	{(u32*)DL698_SETLIB_6012_2_50,},
#endif
#ifdef InitData_6012_2_51_
	{(u32*)DL698_SETLIB_6012_2_51,},
#endif
#ifdef InitData_6012_2_52_
	{(u32*)DL698_SETLIB_6012_2_52,},
#endif
#ifdef InitData_6012_2_53_
	{(u32*)DL698_SETLIB_6012_2_53,},
#endif
#ifdef InitData_6012_2_54_
	{(u32*)DL698_SETLIB_6012_2_54,},
#endif
#ifdef InitData_6012_2_55_
	{(u32*)DL698_SETLIB_6012_2_55,},
#endif
#ifdef InitData_6012_2_56_
	{(u32*)DL698_SETLIB_6012_2_56,},
#endif
#ifdef InitData_6012_2_57_
	{(u32*)DL698_SETLIB_6012_2_57,},
#endif
#ifdef InitData_6012_2_58_
	{(u32*)DL698_SETLIB_6012_2_58,},
#endif
#ifdef InitData_6012_2_59_
	{(u32*)DL698_SETLIB_6012_2_59,},
#endif
#ifdef InitData_6012_2_60_
	{(u32*)DL698_SETLIB_6012_2_60,},
#endif
#ifdef InitData_6012_2_61_
	{(u32*)DL698_SETLIB_6012_2_61,},
#endif	
#ifdef InitData_6012_2_62_
	{(u32*)DL698_SETLIB_6012_2_62,},
#endif
#ifdef InitData_6012_2_63_
	{(u32*)DL698_SETLIB_6012_2_63,},
#endif
#ifdef InitData_6012_2_64_
	{(u32*)DL698_SETLIB_6012_2_64,},
#endif
#ifdef InitData_6012_2_65_
	{(u32*)DL698_SETLIB_6012_2_65,},
#endif
#ifdef InitData_6012_2_66_
	{(u32*)DL698_SETLIB_6012_2_66,},
#endif
#ifdef InitData_6012_2_67_
	{(u32*)DL698_SETLIB_6012_2_67,},
#endif
#ifdef InitData_6012_2_68_
	{(u32*)DL698_SETLIB_6012_2_68,},
#endif
#ifdef InitData_6012_2_69_
	{(u32*)DL698_SETLIB_6012_2_69,},
#endif
#ifdef InitData_6012_2_70_
	{(u32*)DL698_SETLIB_6012_2_70,},
#endif
#ifdef InitData_6012_2_71_
	{(u32*)DL698_SETLIB_6012_2_71,},
#endif
#ifdef InitData_6012_2_72_
	{(u32*)DL698_SETLIB_6012_2_72,},
#endif
#ifdef InitData_6012_2_73_
	{(u32*)DL698_SETLIB_6012_2_73,},
#endif
#ifdef InitData_6012_2_74_
	{(u32*)DL698_SETLIB_6012_2_74,},
#endif
#ifdef InitData_6012_2_75_
	{(u32*)DL698_SETLIB_6012_2_75,},
#endif
#ifdef InitData_6012_2_76_
	{(u32*)DL698_SETLIB_6012_2_76,},
#endif
#ifdef InitData_6012_2_77_
	{(u32*)DL698_SETLIB_6012_2_77,},
#endif
#ifdef InitData_6012_2_78_
	{(u32*)DL698_SETLIB_6012_2_78,},
#endif
#ifdef InitData_6012_2_79_
	{(u32*)DL698_SETLIB_6012_2_79,},
#endif
#ifdef InitData_6012_2_80_
	{(u32*)DL698_SETLIB_6012_2_80,},
#endif
#ifdef InitData_6012_2_81_
	{(u32*)DL698_SETLIB_6012_2_81,},
#endif
#ifdef InitData_6012_2_82_
	{(u32*)DL698_SETLIB_6012_2_82,},
#endif
#ifdef InitData_6012_2_83_
	{(u32*)DL698_SETLIB_6012_2_83,},
#endif
#ifdef InitData_6012_2_84_
	{(u32*)DL698_SETLIB_6012_2_84,},
#endif	
#ifdef InitData_6012_2_85_
	{(u32*)DL698_SETLIB_6012_2_85,},
#endif
#ifdef InitData_6012_2_86_
	{(u32*)DL698_SETLIB_6012_2_86,},
#endif
#ifdef InitData_6012_2_87_
	{(u32*)DL698_SETLIB_6012_2_87,},
#endif
#ifdef InitData_6012_2_88_
	{(u32*)DL698_SETLIB_6012_2_88,},
#endif
#ifdef InitData_6012_2_89_
	{(u32*)DL698_SETLIB_6012_2_89,},
#endif
#ifdef InitData_6012_2_90_
	{(u32*)DL698_SETLIB_6012_2_90,},
#endif
#ifdef InitData_6012_2_91_
	{(u32*)DL698_SETLIB_6012_2_91,},
#endif
#ifdef InitData_6012_2_92_
	{(u32*)DL698_SETLIB_6012_2_92,},
#endif
#ifdef InitData_6012_2_93_
	{(u32*)DL698_SETLIB_6012_2_93,},
#endif
#ifdef InitData_6012_2_94_
	{(u32*)DL698_SETLIB_6012_2_94,},
#endif
#ifdef InitData_6012_2_95_
	{(u32*)DL698_SETLIB_6012_2_95,},
#endif
#ifdef InitData_6012_2_96_
	{(u32*)DL698_SETLIB_6012_2_96,},
#endif
#ifdef InitData_6012_2_97_
	{(u32*)DL698_SETLIB_6012_2_97,},
#endif
#ifdef InitData_6012_2_98_
	{(u32*)DL698_SETLIB_6012_2_98,},
#endif
#ifdef InitData_6012_2_99_
	{(u32*)DL698_SETLIB_6012_2_99,},
#endif
#ifdef InitData_6012_2_100_
	{(u32*)DL698_SETLIB_6012_2_100,},
#endif
#ifdef InitData_6012_2_101_
	{(u32*)DL698_SETLIB_6012_2_101,},
#endif
#ifdef InitData_6012_2_102_
	{(u32*)DL698_SETLIB_6012_2_102,},
#endif
#ifdef InitData_6012_2_103_
	{(u32*)DL698_SETLIB_6012_2_103,},
#endif
#ifdef InitData_6012_2_104_
	{(u32*)DL698_SETLIB_6012_2_104,},
#endif
#ifdef InitData_6012_2_105_
	{(u32*)DL698_SETLIB_6012_2_105,},
#endif
#ifdef InitData_6012_2_106_
	{(u32*)DL698_SETLIB_6012_2_106,},
#endif
#ifdef InitData_6012_2_107_
	{(u32*)DL698_SETLIB_6012_2_107,},
#endif
#ifdef InitData_6012_2_108_
	{(u32*)DL698_SETLIB_6012_2_108,},
#endif
#ifdef InitData_6012_2_109_
	{(u32*)DL698_SETLIB_6012_2_109,},
#endif
#ifdef InitData_6012_2_110_
	{(u32*)DL698_SETLIB_6012_2_110,},
#endif
#ifdef InitData_6012_2_111_
	{(u32*)DL698_SETLIB_6012_2_111,},
#endif
#ifdef InitData_6012_2_112_
	{(u32*)DL698_SETLIB_6012_2_112,},
#endif
#ifdef InitData_6012_2_113_
	{(u32*)DL698_SETLIB_6012_2_113,},
#endif
#ifdef InitData_6012_2_114_
	{(u32*)DL698_SETLIB_6012_2_114,},
#endif
#ifdef InitData_6012_2_115_
	{(u32*)DL698_SETLIB_6012_2_115,},
#endif
#ifdef InitData_6012_2_116_
	{(u32*)DL698_SETLIB_6012_2_116,},
#endif
#ifdef InitData_6012_2_117_
	{(u32*)DL698_SETLIB_6012_2_117,},
#endif
#ifdef InitData_6012_2_118_
	{(u32*)DL698_SETLIB_6012_2_118,},
#endif
#ifdef InitData_6012_2_119_
	{(u32*)DL698_SETLIB_6012_2_119,},
#endif
#ifdef InitData_6012_2_120_
	{(u32*)DL698_SETLIB_6012_2_120,},
#endif
#ifdef InitData_6012_2_121_
	{(u32*)DL698_SETLIB_6012_2_121,},
#endif
#ifdef InitData_6012_2_122_
	{(u32*)DL698_SETLIB_6012_2_122,},
#endif
#ifdef InitData_6012_2_123_
	{(u32*)DL698_SETLIB_6012_2_123,},
#endif
#ifdef InitData_6012_2_124_
	{(u32*)DL698_SETLIB_6012_2_124,},
#endif
#ifdef InitData_6012_2_125_
	{(u32*)DL698_SETLIB_6012_2_125,},
#endif
#ifdef InitData_6012_2_126_
	{(u32*)DL698_SETLIB_6012_2_126,},
#endif
#ifdef InitData_6012_2_127_
	{(u32*)DL698_SETLIB_6012_2_127,},
#endif
#ifdef InitData_6012_2_128_
	{(u32*)DL698_SETLIB_6012_2_128,},
#endif
		
#if NUMmax_6012_2>(128+1)//最大抄表任务数
	#error
#endif
	
	{(u32*)DL698_SETLIB_6014_2_0,},//定位第0个地址，不能删除
#ifdef InitData_6014_2_1_
	{(u32*)DL698_SETLIB_6014_2_1,},
#endif
#ifdef InitData_6014_2_2_
	{(u32*)DL698_SETLIB_6014_2_2,},
#endif
#ifdef InitData_6014_2_3_
	{(u32*)DL698_SETLIB_6014_2_3,},
#endif
#ifdef InitData_6014_2_4_
	{(u32*)DL698_SETLIB_6014_2_4,},
#endif
#ifdef InitData_6014_2_5_
	{(u32*)DL698_SETLIB_6014_2_5,},
#endif
#ifdef InitData_6014_2_6_
	{(u32*)DL698_SETLIB_6014_2_6,},
#endif
#ifdef InitData_6014_2_7_
	{(u32*)DL698_SETLIB_6014_2_7,},
#endif
#ifdef InitData_6014_2_8_
	{(u32*)DL698_SETLIB_6014_2_8,},
#endif
#ifdef InitData_6014_2_9_
	{(u32*)DL698_SETLIB_6014_2_9,},
#endif
#ifdef InitData_6014_2_10_
	{(u32*)DL698_SETLIB_6014_2_10,},
#endif
#ifdef InitData_6014_2_11_
	{(u32*)DL698_SETLIB_6014_2_11,},
#endif
#ifdef InitData_6014_2_12_
	{(u32*)DL698_SETLIB_6014_2_12,},
#endif
#ifdef InitData_6014_2_13_
	{(u32*)DL698_SETLIB_6014_2_13,},
#endif
#ifdef InitData_6014_2_14_
	{(u32*)DL698_SETLIB_6014_2_14,},
#endif
#ifdef InitData_6014_2_15_
	{(u32*)DL698_SETLIB_6014_2_15,},
#endif
#ifdef InitData_6014_2_16_
	{(u32*)DL698_SETLIB_6014_2_16,},
#endif
#ifdef InitData_6014_2_17_
	{(u32*)DL698_SETLIB_6014_2_17,},
#endif
#ifdef InitData_6014_2_18_
	{(u32*)DL698_SETLIB_6014_2_18,},
#endif
#ifdef InitData_6014_2_19_
	{(u32*)DL698_SETLIB_6014_2_19,},
#endif
#ifdef InitData_6014_2_20_
	{(u32*)DL698_SETLIB_6014_2_20,},
#endif
#ifdef InitData_6014_2_21_
	{(u32*)DL698_SETLIB_6014_2_21,},
#endif
#ifdef InitData_6014_2_22_
	{(u32*)DL698_SETLIB_6014_2_22,},
#endif
#ifdef InitData_6014_2_23_
	{(u32*)DL698_SETLIB_6014_2_23,},
#endif
#ifdef InitData_6014_2_24_
	{(u32*)DL698_SETLIB_6014_2_24,},
#endif
#ifdef InitData_6014_2_25_
	{(u32*)DL698_SETLIB_6014_2_25,},
#endif
#ifdef InitData_6014_2_26_
	{(u32*)DL698_SETLIB_6014_2_26,},
#endif
#ifdef InitData_6014_2_27_
	{(u32*)DL698_SETLIB_6014_2_27,},
#endif
#ifdef InitData_6014_2_28_
	{(u32*)DL698_SETLIB_6014_2_28,},
#endif
#ifdef InitData_6014_2_29_
	{(u32*)DL698_SETLIB_6014_2_29,},
#endif
#ifdef InitData_6014_2_30_
	{(u32*)DL698_SETLIB_6014_2_30,},
#endif
#ifdef InitData_6014_2_31_
	{(u32*)DL698_SETLIB_6014_2_31,},
#endif
#ifdef InitData_6014_2_32_
	{(u32*)DL698_SETLIB_6014_2_32,},
#endif
#ifdef InitData_6014_2_33_
	{(u32*)DL698_SETLIB_6014_2_33,},
#endif
#ifdef InitData_6014_2_34_
	{(u32*)DL698_SETLIB_6014_2_34,},
#endif
#ifdef InitData_6014_2_35_
	{(u32*)DL698_SETLIB_6014_2_35,},
#endif
#ifdef InitData_6014_2_36_
	{(u32*)DL698_SETLIB_6014_2_36,},
#endif
#ifdef InitData_6014_2_37_
	{(u32*)DL698_SETLIB_6014_2_37,},
#endif
#ifdef InitData_6014_2_38_
	{(u32*)DL698_SETLIB_6014_2_38,},
#endif
#ifdef InitData_6014_2_39_
	{(u32*)DL698_SETLIB_6014_2_39,},
#endif
#ifdef InitData_6014_2_40_
	{(u32*)DL698_SETLIB_6014_2_40,},
#endif
#ifdef InitData_6014_2_41_
	{(u32*)DL698_SETLIB_6014_2_41,},
#endif
#ifdef InitData_6014_2_42_
	{(u32*)DL698_SETLIB_6014_2_42,},
#endif
#ifdef InitData_6014_2_43_
	{(u32*)DL698_SETLIB_6014_2_43,},
#endif
#ifdef InitData_6014_2_44_
	{(u32*)DL698_SETLIB_6014_2_44,},
#endif
#ifdef InitData_6014_2_45_
	{(u32*)DL698_SETLIB_6014_2_45,},
#endif
#ifdef InitData_6014_2_46_
	{(u32*)DL698_SETLIB_6014_2_46,},
#endif
#ifdef InitData_6014_2_47_
	{(u32*)DL698_SETLIB_6014_2_47,},
#endif
#ifdef InitData_6014_2_48_
	{(u32*)DL698_SETLIB_6014_2_48,},
#endif
#ifdef InitData_6014_2_49_
	{(u32*)DL698_SETLIB_6014_2_49,},
#endif
#ifdef InitData_6014_2_50_
	{(u32*)DL698_SETLIB_6014_2_50,},
#endif
#ifdef InitData_6014_2_51_
	{(u32*)DL698_SETLIB_6014_2_51,},
#endif
#ifdef InitData_6014_2_52_
	{(u32*)DL698_SETLIB_6014_2_52,},
#endif
#ifdef InitData_6014_2_53_
	{(u32*)DL698_SETLIB_6014_2_53,},
#endif
#ifdef InitData_6014_2_54_
	{(u32*)DL698_SETLIB_6014_2_54,},
#endif
#ifdef InitData_6014_2_55_
	{(u32*)DL698_SETLIB_6014_2_55,},
#endif
#ifdef InitData_6014_2_56_
	{(u32*)DL698_SETLIB_6014_2_56,},
#endif
#ifdef InitData_6014_2_57_
	{(u32*)DL698_SETLIB_6014_2_57,},
#endif
#ifdef InitData_6014_2_58_
	{(u32*)DL698_SETLIB_6014_2_58,},
#endif
#ifdef InitData_6014_2_59_
	{(u32*)DL698_SETLIB_6014_2_59,},
#endif
#ifdef InitData_6014_2_60_
	{(u32*)DL698_SETLIB_6014_2_60,},
#endif
#ifdef InitData_6014_2_61_
	{(u32*)DL698_SETLIB_6014_2_61,},
#endif
#ifdef InitData_6014_2_62_
	{(u32*)DL698_SETLIB_6014_2_62,},
#endif
#ifdef InitData_6014_2_63_
	{(u32*)DL698_SETLIB_6014_2_63,},
#endif
#ifdef InitData_6014_2_64_
	{(u32*)DL698_SETLIB_6014_2_64,},
#endif
	
#if NUMmax_6014>(64+1)//最大普通采集方案数
	#error
#endif
	
	{(u32*)DL698_SETLIB_6014_3,},
	{(u32*)DL698_SETLIB_6014_4,},
	
	{(u32*)DL698_SETLIB_6016_2,},//定位第0个地址，不能删除
#ifdef InitData_6016_2_1_
	{(u32*)DL698_SETLIB_6016_2_1,},
#endif
#ifdef InitData_6016_2_2_
	{(u32*)DL698_SETLIB_6016_2_2,},
#endif
#ifdef InitData_6016_2_3_
	{(u32*)DL698_SETLIB_6016_2_3,},
#endif
#ifdef InitData_6016_2_4_
	{(u32*)DL698_SETLIB_6016_2_4,},
#endif
#ifdef InitData_6016_2_5_
	{(u32*)DL698_SETLIB_6016_2_5,},
#endif
#ifdef InitData_6016_2_6_
	{(u32*)DL698_SETLIB_6016_2_6,},
#endif
#ifdef InitData_6016_2_7_
	{(u32*)DL698_SETLIB_6016_2_7,},
#endif
#ifdef InitData_6016_2_8_
	{(u32*)DL698_SETLIB_6016_2_8,},
#endif
#ifdef InitData_6016_2_9_
	{(u32*)DL698_SETLIB_6016_2_9,},
#endif
#ifdef InitData_6016_2_10_
	{(u32*)DL698_SETLIB_6016_2_10,},
#endif
#ifdef InitData_6016_2_11_
	{(u32*)DL698_SETLIB_6016_2_11,},
#endif
#ifdef InitData_6016_2_12_
	{(u32*)DL698_SETLIB_6016_2_12,},
#endif
#ifdef InitData_6016_2_13_
	{(u32*)DL698_SETLIB_6016_2_13,},
#endif
#ifdef InitData_6016_2_14_
	{(u32*)DL698_SETLIB_6016_2_14,},
#endif
#ifdef InitData_6016_2_15_
	{(u32*)DL698_SETLIB_6016_2_15,},
#endif
#ifdef InitData_6016_2_16_
	{(u32*)DL698_SETLIB_6016_2_16,},
#endif
#ifdef InitData_6016_2_17_
	{(u32*)DL698_SETLIB_6016_2_17,},
#endif
#ifdef InitData_6016_2_18_
	{(u32*)DL698_SETLIB_6016_2_18,},
#endif
#ifdef InitData_6016_2_19_
	{(u32*)DL698_SETLIB_6016_2_19,},
#endif
#ifdef InitData_6016_2_20_
	{(u32*)DL698_SETLIB_6016_2_20,},
#endif
#ifdef InitData_6016_2_21_
	{(u32*)DL698_SETLIB_6016_2_21,},
#endif
#ifdef InitData_6016_2_22_
	{(u32*)DL698_SETLIB_6016_2_22,},
#endif
#ifdef InitData_6016_2_23_
	{(u32*)DL698_SETLIB_6016_2_23,},
#endif
#ifdef InitData_6016_2_24_
	{(u32*)DL698_SETLIB_6016_2_24,},
#endif
#ifdef InitData_6016_2_25_
	{(u32*)DL698_SETLIB_6016_2_25,},
#endif
#ifdef InitData_6016_2_26_
	{(u32*)DL698_SETLIB_6016_2_26,},
#endif
#ifdef InitData_6016_2_27_
	{(u32*)DL698_SETLIB_6016_2_27,},
#endif
#ifdef InitData_6016_2_28_
	{(u32*)DL698_SETLIB_6016_2_28,},
#endif
#ifdef InitData_6016_2_29_
	{(u32*)DL698_SETLIB_6016_2_29,},
#endif
#ifdef InitData_6016_2_30_
	{(u32*)DL698_SETLIB_6016_2_30,},
#endif
#ifdef InitData_6016_2_31_
	{(u32*)DL698_SETLIB_6016_2_31,},
#endif
#ifdef InitData_6016_2_32_
	{(u32*)DL698_SETLIB_6016_2_32,},
#endif
#ifdef InitData_6016_2_33_
	{(u32*)DL698_SETLIB_6016_2_33,},
#endif
#ifdef InitData_6016_2_34_
	{(u32*)DL698_SETLIB_6016_2_34,},
#endif
#ifdef InitData_6016_2_35_
	{(u32*)DL698_SETLIB_6016_2_35,},
#endif
#ifdef InitData_6016_2_36_
	{(u32*)DL698_SETLIB_6016_2_36,},
#endif
#ifdef InitData_6016_2_37_
	{(u32*)DL698_SETLIB_6016_2_37,},
#endif
#ifdef InitData_6016_2_38_
	{(u32*)DL698_SETLIB_6016_2_38,},
#endif
#ifdef InitData_6016_2_39_
	{(u32*)DL698_SETLIB_6016_2_39,},
#endif
#ifdef InitData_6016_2_40_
	{(u32*)DL698_SETLIB_6016_2_40,},
#endif
#ifdef InitData_6016_2_41_
	{(u32*)DL698_SETLIB_6016_2_41,},
#endif
#ifdef InitData_6016_2_42_
	{(u32*)DL698_SETLIB_6016_2_42,},
#endif
#ifdef InitData_6016_2_43_
	{(u32*)DL698_SETLIB_6016_2_43,},
#endif
#ifdef InitData_6016_2_44_
	{(u32*)DL698_SETLIB_6016_2_44,},
#endif
#ifdef InitData_6016_2_45_
	{(u32*)DL698_SETLIB_6016_2_45,},
#endif
#ifdef InitData_6016_2_46_
	{(u32*)DL698_SETLIB_6016_2_46,},
#endif
#ifdef InitData_6016_2_47_
	{(u32*)DL698_SETLIB_6016_2_47,},
#endif
#ifdef InitData_6016_2_48_
	{(u32*)DL698_SETLIB_6016_2_48,},
#endif
#ifdef InitData_6016_2_49_
	{(u32*)DL698_SETLIB_6016_2_49,},
#endif
#ifdef InitData_6016_2_50_
	{(u32*)DL698_SETLIB_6016_2_50,},
#endif
#ifdef InitData_6016_2_51_
	{(u32*)DL698_SETLIB_6016_2_51,},
#endif
#ifdef InitData_6016_2_52_
	{(u32*)DL698_SETLIB_6016_2_52,},
#endif
#ifdef InitData_6016_2_53_
	{(u32*)DL698_SETLIB_6016_2_53,},
#endif
#ifdef InitData_6016_2_54_
	{(u32*)DL698_SETLIB_6016_2_54,},
#endif
#ifdef InitData_6016_2_55_
	{(u32*)DL698_SETLIB_6016_2_55,},
#endif
#ifdef InitData_6016_2_56_
	{(u32*)DL698_SETLIB_6016_2_56,},
#endif
#ifdef InitData_6016_2_57_
	{(u32*)DL698_SETLIB_6016_2_57,},
#endif
#ifdef InitData_6016_2_58_
	{(u32*)DL698_SETLIB_6016_2_58,},
#endif
#ifdef InitData_6016_2_59_
	{(u32*)DL698_SETLIB_6016_2_59,},
#endif
#ifdef InitData_6016_2_60_
	{(u32*)DL698_SETLIB_6016_2_60,},
#endif
#ifdef InitData_6016_2_61_
	{(u32*)DL698_SETLIB_6016_2_61,},
#endif
#ifdef InitData_6016_2_62_
	{(u32*)DL698_SETLIB_6016_2_62,},
#endif
#ifdef InitData_6016_2_63_
	{(u32*)DL698_SETLIB_6016_2_63,},
#endif
#ifdef InitData_6016_2_64_
	{(u32*)DL698_SETLIB_6016_2_64,},
#endif
	
#if NUMmax_6016>(64+1)//最大事件采集方案数
	#error
#endif
	
	
	{(u32*)DL698_SETLIB_6016_3,},
	{(u32*)DL698_SETLIB_6016_4,},
	{(u32*)DL698_SETLIB_6018,},
	{(u32*)DL698_SETLIB_6018_3,},
	{(u32*)DL698_SETLIB_6018_4,},
	{(u32*)DL698_SETLIB_601A,},
	{(u32*)DL698_SETLIB_601A_3,},
	{(u32*)DL698_SETLIB_601A_4,},
	{(u32*)DL698_SETLIB_601C,},
#ifdef InitData_601C_2_1_
    {(u32*)DL698_SETLIB_601C_2_1},
#endif
#ifdef InitData_601C_2_2_
    {(u32*)DL698_SETLIB_601C_2_2},
#endif
#ifdef InitData_601C_2_3_
    {(u32*)DL698_SETLIB_601C_2_3},
#endif
#ifdef InitData_601C_2_4_
    {(u32*)DL698_SETLIB_601C_2_4},
#endif
#ifdef InitData_601C_2_5_
    {(u32*)DL698_SETLIB_601C_2_5},
#endif
#ifdef InitData_601C_2_6_
    {(u32*)DL698_SETLIB_601C_2_6},
#endif
#ifdef InitData_601C_2_7_
    {(u32*)DL698_SETLIB_601C_2_7},
#endif
#ifdef InitData_601C_2_8_
    {(u32*)DL698_SETLIB_601C_2_8},
#endif
#ifdef InitData_601C_2_9_
    {(u32*)DL698_SETLIB_601C_2_9},
#endif    
#ifdef InitData_601C_2_10_
    {(u32*)DL698_SETLIB_601C_2_10},
#endif    
#ifdef InitData_601C_2_11_
    {(u32*)DL698_SETLIB_601C_2_11},
#endif
#ifdef InitData_601C_2_12_
    {(u32*)DL698_SETLIB_601C_2_12},
#endif    
#ifdef InitData_601C_2_13_
    {(u32*)DL698_SETLIB_601C_2_13},
#endif    
#ifdef InitData_601C_2_14_
    {(u32*)DL698_SETLIB_601C_2_14},
#endif   
#ifdef InitData_601C_2_15_
    {(u32*)DL698_SETLIB_601C_2_15},
#endif    
#ifdef InitData_601C_2_16_
    {(u32*)DL698_SETLIB_601C_2_16},
#endif    
#ifdef InitData_601C_2_17_
    {(u32*)DL698_SETLIB_601C_2_17},
#endif
#ifdef InitData_601C_2_18_
    {(u32*)DL698_SETLIB_601C_2_18},
#endif
#ifdef InitData_601C_2_19_
    {(u32*)DL698_SETLIB_601C_2_19},
#endif    
#ifdef InitData_601C_2_20_
    {(u32*)DL698_SETLIB_601C_2_20},
#endif    
#ifdef InitData_601C_2_21_
    {(u32*)DL698_SETLIB_601C_2_21},
#endif
#ifdef InitData_601C_2_22_
    {(u32*)DL698_SETLIB_601C_2_22},
#endif
#ifdef InitData_601C_2_23_
    {(u32*)DL698_SETLIB_601C_2_23},
#endif
#ifdef InitData_601C_2_24_
    {(u32*)DL698_SETLIB_601C_2_24},
#endif
#ifdef InitData_601C_2_25_
    {(u32*)DL698_SETLIB_601C_2_25},
#endif
#ifdef InitData_601C_2_26_
    {(u32*)DL698_SETLIB_601C_2_26},
#endif
#ifdef InitData_601C_2_27_
    {(u32*)DL698_SETLIB_601C_2_27},
#endif
#ifdef InitData_601C_2_28_
    {(u32*)DL698_SETLIB_601C_2_28},
#endif
#ifdef InitData_601C_2_29_
    {(u32*)DL698_SETLIB_601C_2_29},
#endif   
#ifdef InitData_601C_2_30_
    {(u32*)DL698_SETLIB_601C_2_30},
#endif     
#ifdef InitData_601C_2_31_
    {(u32*)DL698_SETLIB_601C_2_31},
#endif
#ifdef InitData_601C_2_32_
    {(u32*)DL698_SETLIB_601C_2_32},
#endif
#ifdef InitData_601C_2_33_
    {(u32*)DL698_SETLIB_601C_2_33},
#endif
#ifdef InitData_601C_2_34_
    {(u32*)DL698_SETLIB_601C_2_34},
#endif
#ifdef InitData_601C_2_35_
    {(u32*)DL698_SETLIB_601C_2_35},
#endif
#ifdef InitData_601C_2_36_
    {(u32*)DL698_SETLIB_601C_2_36},
#endif
#ifdef InitData_601C_2_37_
    {(u32*)DL698_SETLIB_601C_2_37},
#endif
#ifdef InitData_601C_2_38_
    {(u32*)DL698_SETLIB_601C_2_38},
#endif
#ifdef InitData_601C_2_39_
    {(u32*)DL698_SETLIB_601C_2_39},
#endif    
#ifdef InitData_601C_2_40_
    {(u32*)DL698_SETLIB_601C_2_40},
#endif     
#ifdef InitData_601C_2_41_
    {(u32*)DL698_SETLIB_601C_2_41},
#endif
#ifdef InitData_601C_2_42_
    {(u32*)DL698_SETLIB_601C_2_42},
#endif
#ifdef InitData_601C_2_43_
    {(u32*)DL698_SETLIB_601C_2_43},
#endif
#ifdef InitData_601C_2_44_
    {(u32*)DL698_SETLIB_601C_2_44},
#endif
#ifdef InitData_601C_2_45_
    {(u32*)DL698_SETLIB_601C_2_45},
#endif
#ifdef InitData_601C_2_46_
    {(u32*)DL698_SETLIB_601C_2_46},
#endif
#ifdef InitData_601C_2_47_
    {(u32*)DL698_SETLIB_601C_2_47},
#endif
#ifdef InitData_601C_2_48_
    {(u32*)DL698_SETLIB_601C_2_48},
#endif
#ifdef InitData_601C_2_49_
    {(u32*)DL698_SETLIB_601C_2_49},
#endif
#ifdef InitData_601C_2_50_
    {(u32*)DL698_SETLIB_601C_2_50},
#endif
#ifdef InitData_601C_2_51_
    {(u32*)DL698_SETLIB_601C_2_51},
#endif
#ifdef InitData_601C_2_52_
    {(u32*)DL698_SETLIB_601C_2_52},
#endif
#ifdef InitData_601C_2_53_
    {(u32*)DL698_SETLIB_601C_2_53},
#endif
#ifdef InitData_601C_2_54_
    {(u32*)DL698_SETLIB_601C_2_54},
#endif
#ifdef InitData_601C_2_55_
    {(u32*)DL698_SETLIB_601C_2_55},
#endif
#ifdef InitData_601C_2_56_
    {(u32*)DL698_SETLIB_601C_2_56},
#endif
#ifdef InitData_601C_2_57_
    {(u32*)DL698_SETLIB_601C_2_57},
#endif
#ifdef InitData_601C_2_58_
    {(u32*)DL698_SETLIB_601C_2_58},
#endif
#ifdef InitData_601C_2_59_
    {(u32*)DL698_SETLIB_601C_2_59},
#endif
#ifdef InitData_601C_2_60_
    {(u32*)DL698_SETLIB_601C_2_60},
#endif
#ifdef InitData_601C_2_61_
    {(u32*)DL698_SETLIB_601C_2_61},
#endif
#ifdef InitData_601C_2_62_
    {(u32*)DL698_SETLIB_601C_2_62},
#endif
#ifdef InitData_601C_2_63_
    {(u32*)DL698_SETLIB_601C_2_63},
#endif
#ifdef InitData_601C_2_64_
    {(u32*)DL698_SETLIB_601C_2_64},
#endif
#if NUMmax_601C>(64+1)//最大上报方案数
	#error
#endif
	
	{(u32*)DL698_SETLIB_601C_3,},
	{(u32*)DL698_SETLIB_601C_4,},
	{(u32*)DL698_SETLIB_601E,},
	{(u32*)DL698_SETLIB_601E_3,},
	{(u32*)DL698_SETLIB_601E_4,},
	{(u32*)DL698_SETLIB_6032,},
	{(u32*)DL698_SETLIB_6032_3,},
	{(u32*)DL698_SETLIB_6032_4,},
	{(u32*)DL698_SETLIB_6034,},
	{(u32*)DL698_SETLIB_6034_3,},
	{(u32*)DL698_SETLIB_6034_4,},

#if (USER/100)==14//福建增补
	{(u32*)DL698_SETLIB_6E00,},
	{(u32*)DL698_SETLIB_6E01,},
	{(u32*)DL698_SETLIB_6E11,},
	{(u32*)DL698_SETLIB_6E13,},
	{(u32*)DL698_SETLIB_6E17,},
	{(u32*)DL698_SETLIB_6E30,},
	{(u32*)DL698_SETLIB_6E33,},

