gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_SETLIB.c
#endif//#if (USER/100)==14//福建增补
#if (USER/100)==15//安徽
	{(u32*)DL698_SETLIB_3106_11,},
#endif
	
//#if (USER/100)==17//???
	{(u32*)DL698_SETLIB_4048,},
//#endif
	
//集合类
	
	
	
//控制类
	{(u32*)DL698_SETLIB_8000_2,},
	{(u32*)DL698_SETLIB_8000_3,},
	{(u32*)DL698_SETLIB_8000_4,},
	{(u32*)DL698_SETLIB_8000_5,},
	{(u32*)DL698_SETLIB_8001_2,},
	{(u32*)DL698_SETLIB_8001_3,},
	{(u32*)DL698_SETLIB_8001_4,},
	{(u32*)DL698_SETLIB_8001_5,},
	{(u32*)DL698_SETLIB_8002_2,},
	{(u32*)DL698_SETLIB_8002_3,},
	
	{(u32*)DL698_SETLIB_8100_2,},
	{(u32*)DL698_SETLIB_8101_2,},
	{(u32*)DL698_SETLIB_8102_2,},
	{(u32*)DL698_SETLIB_8103_2,},
	{(u32*)DL698_SETLIB_8103_3,},
	{(u32*)DL698_SETLIB_8103_4,},
	{(u32*)DL698_SETLIB_8103_5,},
	{(u32*)DL698_SETLIB_8104_2,},
	{(u32*)DL698_SETLIB_8104_3,},
	{(u32*)DL698_SETLIB_8104_4,},
	{(u32*)DL698_SETLIB_8104_5,},
	{(u32*)DL698_SETLIB_8105_2,},
	{(u32*)DL698_SETLIB_8105_3,},
	{(u32*)DL698_SETLIB_8105_4,},
	{(u32*)DL698_SETLIB_8105_5,},
	{(u32*)DL698_SETLIB_8106_3,},
	{(u32*)DL698_SETLIB_8106_4,},
	{(u32*)DL698_SETLIB_8106_5,},
	{(u32*)DL698_SETLIB_8107_2,},
	{(u32*)DL698_SETLIB_8107_3,},
	{(u32*)DL698_SETLIB_8107_4,},
	{(u32*)DL698_SETLIB_8107_5,},
	{(u32*)DL698_SETLIB_8108_2,},
	{(u32*)DL698_SETLIB_8108_3,},
	{(u32*)DL698_SETLIB_8108_4,},
	{(u32*)DL698_SETLIB_8108_5,},
	
	{(u32*)DL698_SETLIB_230x_2,},//总加配置表(仅用于初始化)
	{(u32*)DL698_SETLIB_230x_13,},//总加组滑差时间周期(仅用于初始化)
	{(u32*)DL698_SETLIB_230x_14,},//总加组功控轮次配置(仅用于初始化)
	{(u32*)DL698_SETLIB_230x_15,},//总加组电控轮次配置(仅用于初始化)
	{(u32*)DL698_SETLIB_240x_2,},//脉冲计量-通信地址(仅用于初始化)
	{(u32*)DL698_SETLIB_240x_3,},//脉冲计量-互感器倍率(仅用于初始化)
	{(u32*)DL698_SETLIB_240x_4,},//脉冲计量-脉冲配置(仅用于初始化)
	
	
//文件传输类
	{(u32*)DL698_SETLIB_F002_4,},//FTP服务器信息
	
//ESAM接口类
	{(u32*)DL698_SETLIB_F100_2,},
	{(u32*)DL698_SETLIB_F100_3,},
	{(u32*)DL698_SETLIB_F100_4,},
	{(u32*)DL698_SETLIB_F100_5,},
	{(u32*)DL698_SETLIB_F100_6,},
	{(u32*)DL698_SETLIB_F100_7,},
	{(u32*)DL698_SETLIB_F100_8,},
	{(u32*)DL698_SETLIB_F100_9,},
	{(u32*)DL698_SETLIB_F100_10,},
	{(u32*)DL698_SETLIB_F100_11,},
	{(u32*)DL698_SETLIB_F100_12,},
	{(u32*)DL698_SETLIB_F100_13,},
	{(u32*)DL698_SETLIB_F101_2,},
	{(u32*)DL698_SETLIB_F101_3,},
//输入输出设备类
	{(u32*)DL698_SETLIB_F200_2,},
	{(u32*)DL698_SETLIB_F200_3,},
	{(u32*)DL698_SETLIB_F201_2,},
	{(u32*)DL698_SETLIB_F201_3,},
	{(u32*)DL698_SETLIB_F202_2,},
	{(u32*)DL698_SETLIB_F202_3,},
	{(u32*)DL698_SETLIB_F203_2,},
	{(u32*)DL698_SETLIB_F203_3,},
	{(u32*)DL698_SETLIB_F203_4,},
	{(u32*)DL698_SETLIB_F204_2,},
	{(u32*)DL698_SETLIB_F204_3,},
	{(u32*)DL698_SETLIB_F204_4,},
	{(u32*)DL698_SETLIB_F205_2,},
	{(u32*)DL698_SETLIB_F205_3,},
	{(u32*)DL698_SETLIB_F206_2,},
	{(u32*)DL698_SETLIB_F206_3,},
	{(u32*)DL698_SETLIB_F206_4,},
	{(u32*)DL698_SETLIB_F207_2,},
	{(u32*)DL698_SETLIB_F207_3,},
	{(u32*)DL698_SETLIB_F209_2,},
	{(u32*)DL698_SETLIB_F209_3,},
	{(u32*)DL698_SETLIB_F209_6,},
	{(u32*)DL698_SETLIB_F209_9,},
	{(u32*)DL698_SETLIB_F209_11,},
	{(u32*)DL698_SETLIB_F209_22,},
	{(u32*)DL698_SETLIB_F20A_2,},
	{(u32*)DL698_SETLIB_F20A_3,},
	{(u32*)DL698_SETLIB_F20B_2,},
	{(u32*)DL698_SETLIB_F20B_3,},
	

//显示类
	
	
};










DL698_SETLIB_TypeDef *Get_DL698_SET_pLib(u32 OAD)//得到SET_pLib指针;入口:OAD;返回:Lib指针(=0表示无相应的OI)
{
	u32 i;
	DL698_SETLIB_TypeDef *pLib;

	for(i=0;i<sizeof(DL698_SETLIB_List)/sizeof(DL698_LIB_List_TypeDef);i++)
	{
		pLib=(DL698_SETLIB_TypeDef *)DL698_SETLIB_List[i].pLib;
		if(OAD==pLib->OAD)
		{
			return pLib;
		}
	}
	
	return 0;
}



extern const u8 InitData_6014_2_9[];//实时采集任务

#if (USER/100)==9//河南版
void FileID_V1toV2(void)//FileID版本V1->V2
{
//FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0文件分类
//V2区别V1关键点:
	//1. 增加采集类型14=月冻结数据
	//2. FileID中的存储时标类型V1=0-7,V2=0xf同时表示改为不用了
//--V1---
	//实时数据0x10xxxxxx
	//日冻结月冻结数据0x12xxxxx
	//曲线数据0x136xxxxx
//--V2---
	//实时数据0x10Fxxxxx
	//日冻结数据0x12Fxxxx
	//曲线数据0x13Fxxxxx
	//月冻结数据0x1EFxxxxx
	u32 FILEID;
	u32 filename;
	msFILE_TypeDef *file;
	u32 NUMmax_File;
	ms_Type *ms;

	ms=Get_ms();
	NUMmax_File=((LEN_msFILEmanage-LEN_msFILEunltFlags-12)/sizeof(msFILE_TypeDef));
	file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);
	for(filename=0;filename<NUMmax_File;filename++)
	{
		if(file->BLOCK_ENTRY)
		{
			FILEID=file->FILEID;
			if((FILEID&0xff)==0)
			{//文件分类=0;普通采集方案记录,全事件采集方案记录
				if((FILEID>>28)==1)
				{//方案类型=1;1=普通采集方案,2=事件采集方案,3=透明方案,4=上报方案,5=脚本方案
					switch((FILEID>>20)&0xf)
					{//存储时标类型
						case 0xf:
							break;
					//V1版使用的存储时标类型
					//未定义              （0），
					//任务开始时间        （1），
					//相对当日0点0分    （2），
					//相对上日23点59分  （3），
					//相对上日0点0分    （4），
					//相对当月1日0点0分（5），
					//数据冻结时标        （6）
					//相对上月月末 23 点 59 分 （7）
						case 7:
							//删除V1版月冻结文件
							ms->msfile_Delete(filename);
							break;
						default:
							//其他文件
							FILEID|=0xf<<20;//避免，自动删除任务已不存在的记录文件
							file->FILEID=FILEID;
							break;
					}
				}
			}
		}
		file++;
	}
}
void DataMoveNewAddr(u8* pSOUR)//档案和文件数据转到新地址,入口:原设置参数读到RAM的指针
{
//V1.00
//#define RMTASKmax 			60//最大任务数
//#define NUMmax_6012_2   RMTASKmax//最大抄表任务数
//#define NUMmax_6014     60//最大普通采集方案数
//#define NUMmax_6016     32//最大事件采集方案数
//#define NUMmax_6018     32//最大透明方案数
//#define NUMmax_601C     16//最大上报方案数(此数影响文件管理的最大文件个数)
typedef __packed struct
{
	u16 BLOCK_ENTRY;//文件入口:nand flash块号,0=空;RAM 开始地址高2字节(值有效时!=0)
	u16 BLOCK_END;//文件结束:nand flash块号,0=空;RAM 开始地址低2字节
	u32 LEN_FILE;//文件预留占有存储空间总长度
	u32 LEN_DATA;//文件有效数据总长度
	
	u32 FILEID;//FILEID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0文件分类
	//文件分类:
	//0=普通采集方案数据记录
	//1=
	//2=按OI分类的事件记录
	//
	//
	u16 FILECOUNT;//相同FILEID的文件计数号
	u16 NUM_DATA;//文件存入数据个数计数(同抄表成功个数)
	u16 NUM_FAIL;//文件头中写入抄表失败地址个数
	u8 save_date_time_s[7];//采集存储时标
	u8 start_date_time_s[7];//采集启动时间
	u16 NUM_GPRSreport[16];//已上报的数据个数(最大上报方案数)
	u16 NUM_ENETreport[16];//已上报的数据个数(最大上报方案数)
}V100_msFILE_TypeDef;

//V1.10
//#define RMTASKmax 			64//最大任务数
//#define NUMmax_6012_2   RMTASKmax//最大抄表任务数
//#define NUMmax_6014     64//60//最大普通采集方案数
//#define NUMmax_6016     64//32//最大事件采集方案数
//#define NUMmax_6018     64//32//最大透明方案数
//#define NUMmax_601C     64//16//最大上报方案数(此数影响文件管理的最大文件个数)
typedef __packed struct
{
	u16 BLOCK_ENTRY;//文件入口:nand flash块号,0=空;RAM 开始地址高2字节(值有效时!=0)
	u16 BLOCK_END;//文件结束:nand flash块号,0=空;RAM 开始地址低2字节
	u32 LEN_FILE;//文件预留占有存储空间总长度
	u32 LEN_DATA;//文件有效数据总长度
	
	u32 FILEID;//FILEID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0文件分类
	//文件分类:
	//0=普通采集方案数据记录
	//1=
	//2=按OI分类的事件记录
	//
	//
	u16 FILECOUNT;//相同FILEID的文件计数号
	u16 NUM_DATA;//文件存入数据个数计数(同抄表成功个数)
	u16 NUM_FAIL;//文件头中写入抄表失败地址个数
	u8 save_date_time_s[7];//采集存储时标
	u8 start_date_time_s[7];//采集启动时间
 #if GPRS_ENET_REPORT==0//GPRS/ENET主动上报:0=上报分开,1=上报合并
//GPRS,ENET各自上报
	u16 NUM_GPRSreport[NUMmax_601C];//已上报的数据个数(最大上报方案数)
	u16 NUM_ENETreport[NUMmax_601C];//已上报的数据个数(最大上报方案数)
 #else
//GPRS,ENET合并上报
	u16 NUM_GPRSorENETreport[NUMmax_601C];//已上报的数据个数(最大上报方案数)
 #endif
}V110_msFILE_TypeDef;

	u32 i;
	u32 n;
	u8* p8;
	u32* p32;
	u32 filename;
	V100_msFILE_TypeDef *V100_file;
	//V110_msFILE_TypeDef *V110_file;
	u32 NUMmax_FileSour;
	u32 NUMmax_File_New;
	ms_Type *ms;
	os_Type *os;
	FILE* fsfile;


	ms=Get_ms();
	os=Get_os();
	p8=pSOUR;
	p8+=(0x31b4bbbb-(ADDR_DL698_SET_START));//ADDR_6014+(9*512);//原普通采集方案9绝对地址
	for(i=0;i<sizeof(InitData_6014_2_9);i++)
	{
		if(p8[i]!=InitData_6014_2_9[i])
		{
			break;
		}
	}
	if(i>=sizeof(InitData_6014_2_9))
	{//原设置参数是更改前V1.00的参数
		//档案转移
		p8=pSOUR;
		p8+=(0x31b28b40-(ADDR_DL698_SET_START));//ADDR_6000;//原采集档案配置表绝对地址
		MW((u32)p8,ADDR_6000,128*1024);
		//文件管理转移
//#define FILENAMEmax_FLASH     ((LEN_msFILEmanage-LEN_msFILEunltFlags-12)/sizeof(msFILE_TypeDef))//存储在FLASH中的文件的最大文件数
		NUMmax_FileSour=((LEN_msFILEmanage-LEN_msFILEunltFlags-12)/sizeof(V100_msFILE_TypeDef));
		NUMmax_File_New=((LEN_msFILEmanage-LEN_msFILEunltFlags-12)/sizeof(V110_msFILE_TypeDef));
		MC(0,(u32)pSOUR,(LEN_msFILEmanage-LEN_msFILEunltFlags-12));
		n=0;
		V100_file=(V100_msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);
		//V110_file=(V110_msFILE_TypeDef*)(pSOUR);
		for(filename=0;filename<NUMmax_FileSour;filename++)
		{
			if(V100_file->BLOCK_ENTRY)
			{
				if(V100_file->FILECOUNT<400)//(3*96)//曲线数据最大保留点数,免新定义的总文件数比原小而无法全部转移
				{
					if((V100_file->FILEID&0xff)<=1)//限制转移文件类型,免新定义的总文件数比原小而无法全部转移
					{
					//0=普通采集方案,全事件采集方案数据记录
					//1=数据冻结(终端自生成)
					//2=按OI分类的事件记录(终端自生成)
					//3=所有搜表结果
					//4=跨台区搜表结果
					//5=电能表主动上报
						if(n<NUMmax_File_New)
						{
						#if GPRS_ENET_REPORT==0//GPRS/ENET主动上报:0=上报分开,1=上报合并
							MW(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(V100_msFILE_TypeDef)),(u32)pSOUR+(n*sizeof(V110_msFILE_TypeDef)),sizeof(V100_msFILE_TypeDef)-(2*16));
							MW(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(V100_msFILE_TypeDef))+(sizeof(V100_msFILE_TypeDef)-(2*16)),(u32)pSOUR+(n*sizeof(V110_msFILE_TypeDef))+(sizeof(V110_msFILE_TypeDef)-(2*NUMmax_601C)),(2*16));
						#else
							MW(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(V100_msFILE_TypeDef)),(u32)pSOUR+(n*sizeof(V110_msFILE_TypeDef)),sizeof(V100_msFILE_TypeDef)-(2*16));
						#endif
							n++;
							//V110_file++;
							V100_file++;
							continue;
						}
					}
				}
				//没转移的需同步删除文件解放占用的flash
				ms->msfile_Delete(filename);
			}
			V100_file++;
		}
		MW((u32)pSOUR,ADDR_msFILEmanage+LEN_msFILEunltFlags,LEN_msFILEmanage-LEN_msFILEunltFlags-12);
		
		FileID_V1toV2();//FileID版本V1->V2
		//CRC计算
		p32=(u32*)(ADDR_msFILEmanage+LEN_msFILEmanage-8);
		p32[0]=0x12345678;
		p32[1]=RAM_CRC32(ADDR_msFILEmanage,LEN_msFILEmanage-4);//RAM中数据CRC32计算
		MW(ADDR_msFILEmanage,ADDR_msFILEmanage+LEN_msFILEmanage,LEN_msFILEmanage);
		//写入os文件
		os->fchdrive ("N0:");
		os->fchdir("N0:/");
		fsfile=os->fopen("msFILEmanage","w");
		if(fsfile!=NULL)
		{
			i=os->fwrite((void*)ADDR_msFILEmanage,1,LEN_msFILEmanage,fsfile);
			if(i!=LEN_msFILEmanage)
			{
				i=i;
			}
			os->fclose(fsfile);
		}
		return;
	}
	p8=pSOUR;
	p8+=(0x31b4bdbb-(ADDR_DL698_SET_START));//ADDR_6014+(9*512);//原普通采集方案9绝对地址
	for(i=0;i<sizeof(InitData_6014_2_9);i++)
	{
		if(p8[i]!=InitData_6014_2_9[i])
		{
			break;
		}
	}
	if(i>=sizeof(InitData_6014_2_9))
	{//原设置参数是V1.10及以后的参数
		//档案转移
		p8=pSOUR;
		p8+=(0x31b28b40-(ADDR_DL698_SET_START));//ADDR_6000;//原采集档案配置表绝对地址
		MW((u32)p8,ADDR_6000,128*1024);
		//文件管理转移
		FileID_V1toV2();//FileID版本V1->V2
		return;
	}
	
