gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_SETLIB.c
}
#endif//#if (USER/100)==9//河南版


void DL698_SETINIT_601E(u32 Command);//设置参数初始化:入口Command:3=参数初始化(即恢复至出厂配置),4/5=除与系统主站通信外的参数初始化,,6=仅部份参数初始化
void DL698_SETINIT(u32 Command,u8* pOAD)//设置参数初始化:入口Command:3=参数初始化(即恢复至出厂配置),4/5=除与系统主站通信外的参数初始化,,6=仅部份参数初始化
{
	u32 i;
	u32 x;
	u32 n;
	u32 OAD;
	u8* p8;
	DL698_SETLIB_TypeDef *pLib;
	ms_Type *ms;
	u8* pSOUR;
	
	ms=Get_ms();
#ifdef IC_STM32F4xx
	ms->Init_my_heap();
#endif
	i=LEN_FLASH_DL698_SET;
	if(i<LEN_msFILEmanage)
	{
		i=LEN_msFILEmanage;
	}
	pSOUR=ms->ms_malloc(i);//设置数据区总长度
	if(pSOUR)
	{//有内存分配
		//读原设置数据
		MR((u32)pSOUR,ADDR_DL698_SET_START,(ADDR_DL698_SET_END)-(ADDR_DL698_SET_START));
	}
	else
	{//内存分配失败
		if((Command==3)||(Command==7))
		{
			Command=4;//4/5=除与系统主站通信外的参数初始化
		}
	}
	if(Command==6)
	{//6=仅部份参数初始化
		for(i=0;i<sizeof(DL698_SETLIB_List)/sizeof(DL698_LIB_List_TypeDef);i++)
		{
			pLib=(DL698_SETLIB_TypeDef *)DL698_SETLIB_List[i].pLib;
			if(pLib->pInitData)
			{
				if(pLib->LEN_Sour>pLib->LENmax)
				{//原始数据长度>FLASH预留的最大长度
					Comm_Ram->DisplayAllErrorTimer=10;//上电全显或系统错误显示秒定时器
					DisplayStringAutoUp(0,9,(u8*)"\x0""参数长度超限!");//显示字符串自动向上平移;出口:修改下一显示行并寄存在ADDR_AutoRowCol
					continue;
				}
				switch(pLib->OAD)
				{
			#if (USER/100)==9//河南
					//部份参数表
					case 0x40160200://当前套日时段表
					case 0x45200200://公网远程通信多接入点备用通道
					case 0x45000200://公网通信模块1; 2通信配置
						break;
			#endif
					
					case 0xffff://空OI,仅编译时不警告
						break;
					default:
						continue;
				}
				MW((u32)pLib->pInitData,(u32)pLib->Addr,pLib->LEN_Sour);
			}
		}
		ms->ms_free(pSOUR);
		DL698_SETINIT_EVENT(Command,pOAD);//设置参数初始化:入口Command:3=参数初始化(即恢复至出厂配置),4/5=除与系统主站通信外的参数初始化,,6=仅部份参数初始化
		DL698_SETINIT_601E(Command);//设置参数初始化:入口Command:3=参数初始化(即恢复至出厂配置),4/5=除与系统主站通信外的参数初始化,,6=仅部份参数初始化
		return;
	}
	
#if (USER/100)==9//河南版
	if(Comm_Ram->Factory==0x55)
	{//菜单密码初始化
		i=(ProduceDate_year_BCD<<8)|ProduceDate_month_BCD;
	}
	else
	{
		i=MRR(ADDR_MenuKey,3);//菜单密码
	}
#endif
	
	if(Comm_Ram->Factory==0x55)
	{
		MC(0,ADDR_DL698_COMSET_END,(ADDR_DL698_SET_END)-(ADDR_DL698_COMSET_END));//清0
	}
	else
	{
		//非工厂模式，文件传输块状态不清0
		MC(0,ADDR_DL698_COMSET_END,(ADDR_F001_4)-(ADDR_DL698_COMSET_END));//清0
		MC(0,ADDR_F001_END,(ADDR_DL698_SET_END)-(ADDR_F001_END));//清0
	}
	
#if (USER/100)==9//河南版
	MWR(i,ADDR_MenuKey,3);//菜单密码
#endif
	
	for(i=0;i<sizeof(DL698_SETLIB_List)/sizeof(DL698_LIB_List_TypeDef);i++)
	{
		pLib=(DL698_SETLIB_TypeDef *)DL698_SETLIB_List[i].pLib;
	#if (USER/100)==15//安徽
		if(pLib->OAD==0x43000800)
		{
			MR(ADDR_DATABUFF,ADDR_4300_8,LENmax_4300_8);
			p8=(u8*)ADDR_DATABUFF;
			p8[0]=DataType_bool;
			p8[1]=1;
			MW(ADDR_DATABUFF,ADDR_4300_8,LENmax_4300_8);
			continue;
		}
	#endif
		if(pLib->pInitData)
		{
			if(pLib->rw&0x04)
			{//通信参数
				if((Command!=3)&&(Command!=7))
				{//除通信参数外
					continue;
				}
				if((pLib->OAD==0x40010200)&&(Comm_Ram->Factory!=0x55))
				{//通信地址在非工厂状态不变
					continue;
				}
			}
			if(pLib->LEN_Sour>pLib->LENmax)
			{//原始数据长度>FLASH预留的最大长度
				Comm_Ram->DisplayAllErrorTimer=10;//上电全显或系统错误显示秒定时器
				DisplayStringAutoUp(0,9,(u8*)"\x0""参数长度超限!");//显示字符串自动向上平移;出口:修改下一显示行并寄存在ADDR_AutoRowCol
				continue;
			}
			if(pOAD)
			{//参数定义的OAD列表，保持现状，不在恢复之列
				p8=pOAD;//参数∷=array OAD
				n=p8[1];
				p8+=2;
				for(x=0;x<n;x++)
				{
					OAD=(p8[1]<<24)|(p8[2]<<16)|(p8[3]<<8)|p8[4];
					if(OAD==pLib->OAD)
					{
						break;
					}
					p8+=5;
				}
				if(x<n)
				{//有列表，用原设置数据
					if(pSOUR)
					{//有内存分配
						if(pLib->Addr)
						{
							n=pLib->Addr-(ADDR_DL698_SET_START);
							n+=(u32)pSOUR;
							MW(n,(u32)pLib->Addr,pLib->LENmax);
						}
					}
					continue;
				}
			}
		#if (USER/100)!=0//不是电科院测试
			if((pLib->OAD==0x40010200)&&(Comm_Ram->Factory!=0x55))
			{//恢复出厂时通信地址
				MR(ADDR_DATABUFF,ADDR_4001_Factory,LENmax_4001);
				p8=(u8*)ADDR_DATABUFF;
				p8[0]=DataType_octet_string;
				p8[1]=6;
				MW(ADDR_DATABUFF,ADDR_4001,LENmax_4001);
				continue;
			}
		#endif
			if((pLib->OAD==0x40020200)&&(Comm_Ram->Factory!=0x55))
			{//恢复出厂时表号
				MR(ADDR_DATABUFF,ADDR_4001_Factory+LENmax_4001,LENmax_4002);
				p8=(u8*)ADDR_DATABUFF;
				p8[0]=DataType_octet_string;
				p8[1]=6;
				MW(ADDR_DATABUFF,ADDR_4002,LENmax_4002);
				continue;
			}
			if((pLib->OAD==0x40030200)&&(Comm_Ram->Factory!=0x55))
			{//恢复出厂时客户编号
				MR(ADDR_DATABUFF,ADDR_4001_Factory+LENmax_4001+LENmax_4002,LENmax_4003);
				p8=(u8*)ADDR_DATABUFF;
				p8[0]=DataType_octet_string;
				p8[1]=6;
				MW(ADDR_DATABUFF,ADDR_4003,LENmax_4003);
				continue;
			}
			MW((u32)pLib->pInitData,(u32)pLib->Addr,pLib->LEN_Sour);
		}
	}
	
	if(Command==7)//7=参数初始化(档案和nand文件数据转移到新地址)
	{
	#if (USER/100)==9//河南版
		DataMoveNewAddr(pSOUR);//档案和文件数据转到新地址,入口:原设置参数读到RAM的指针
	#endif
	}
	
#if (USER/100)==0//电科院测试
	#if ((Project/100)==2)//集中器
//按终端地址配置档案
	i=MRR(ADDR_4001+7,1);
	i&=0x0f;
	//采集档案配置3
	x=MRR(ADDR_6000+(3*LENper_6000)+55,1);
	x&=0xf0;
	x|=i;
	MWR(x,ADDR_6000+(3*LENper_6000)+55,1);
	MWR(x,ADDR_6000+(3*LENper_6000)+15,1);
	//采集档案配置4
	x=MRR(ADDR_6000+(4*LENper_6000)+55,1);
	x&=0xf0;
	x|=i;
	MWR(x,ADDR_6000+(4*LENper_6000)+55,1);
	MWR(x,ADDR_6000+(4*LENper_6000)+15,1);
	#endif
#endif
	
	ms->ms_free(pSOUR);
	DL698_SETINIT_EVENT(Command,pOAD);//设置参数初始化:入口Command:3=参数初始化(即恢复至出厂配置),4/5=除与系统主站通信外的参数初始化,,6=仅部份参数初始化
	DL698_SETINIT_601E(Command);//设置参数初始化:入口Command:3=参数初始化(即恢复至出厂配置),4/5=除与系统主站通信外的参数初始化,,6=仅部份参数初始化

#if (USER/100)==17//江苏版
	Init_6000_2_1_Addr();//档案序号1通信地址为ADDR_4001地址(固定配为交采时用)
#endif
	if(Command==7)
	{
		WWDT_RESET();//立即使能看门狗复位
	}
}

void Init_6000_2_1_Addr(void)//档案序号1通信地址为ADDR_4001地址(固定配为交采时用)
{
	if(sizeof(InitData_6000_2_1)>LEN_DATABUFF)
	{
		return;
	}
	MR(ADDR_DATABUFF,(u32)InitData_6000_2_1,sizeof(InitData_6000_2_1));
	//取终端地址
	MR(ADDR_DATABUFF+10,ADDR_4001+2,6);
	//
	MW(ADDR_DATABUFF,ADDR_6000+LENper_6000,sizeof(InitData_6000_2_1));
}
 





